Catalogs/ITC_Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ITC_Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_JIRA</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Платформа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Репозиторий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Репозиторий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СоответствиеЗадачИПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеЗадачИПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<BasedOn>
				<xr:Item>Document.ЛистТребований</xr:Item>
				<xr:Item>Document.Задача</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Битрикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Головная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланированоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ITC_Проекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуБюджета();
	ОбновитьТаблицуЗадач();
	
	ITC_ОбщиеСервер.ЗарегистрироватьАктивность(ПараметрыСеанса.ТекущийПользователь, "ОткрытиеПроекта", Строка(Объект.Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуБюджета()
	// #DIP-105# 07.12.2022 ++
	// АХТУНГ! АХТУНГ!
	// Код ниже не работал, как чинить непонятно, поэтому я его закомментировал.
	// TODO: сделать код рабочим
	
	//Запрос = новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	СУММА(ЧасыОбороты.ОтчетПриход) КАК ОтчетПриход,
	//|	СоответствиеЗадачИПроектов.СтатьяБюджета КАК СтатьяБюджета
	//|ПОМЕСТИТЬ ВТ_Факт
	//|ИЗ
	//|	РегистрНакопления.Часы.Обороты(
	//|			,
	//|			,
	//|			Период,
	//|			Задача.Проект = &Проект) КАК ЧасыОбороты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗадачИПроектов КАК СоответствиеЗадачИПроектов
	//|		ПО ЧасыОбороты.Задача = СоответствиеЗадачИПроектов.Задача
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СоответствиеЗадачИПроектов.СтатьяБюджета
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	СтатьяБюджета
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	БюджетОбороты.Проект КАК Проект,
	//|	БюджетОбороты.Статья КАК Статья,
	//|	БюджетОбороты.СтатусСогласования КАК СтатусСогласования,
	//|	БюджетОбороты.РежимСогласования КАК РежимСогласования,
	//|	БюджетОбороты.Этап КАК Этап,
	//|	БюджетОбороты.СуммаОборот КАК Сумма,
	//|	БюджетОбороты.ЧасыОборот КАК Часов,
	//|	ВТ_Факт.ОтчетПриход КАК ЧасовФакт
	//|ИЗ
	//|	РегистрНакопления.Бюджет.Обороты(, , Период, Проект = &Проект) КАК БюджетОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	//|		ПО БюджетОбороты.Статья = ВТ_Факт.СтатьяБюджета";
	//Запрос.УстановитьПараметр("Проект",Объект.Ссылка);
	//яТЗ = Запрос.Выполнить().Выгрузить();
	//СтатьиБюджета.Загрузить(яТЗ);
	
	// #DIP-105# 07.12.2022 --
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗадач()
	// #DIP-105# 07.12.2022 ++
	// АХТУНГ! АХТУНГ!
	// Код ниже не работал, как чинить непонятно, поэтому я его закомментировал.
	// TODO: сделать код рабочим
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Проект",Объект.Ссылка);
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОбЗадача.Ссылка КАК Задача,
	//|	ОбЗадача.ЗапланированоЧасов КАК ЗапланированоЧасов,
	//|	ОбЗадача.ЖелаемаяДатаЗавершения КАК ЖелаемаяДатаЗавершения,
	//|	ОбЗадача.Тема КАК Тема,
	//|	ОбЗадача.Статус КАК Статус,
	//|	ОбЗадача.Головная КАК Головная,
	//|	ОбЗадача.ПометкаУдаления КАК ПометкаУдаления,
	//|	ОбЗадача.Основание КАК Основание
	//|ПОМЕСТИТЬ ВТ_Задачи
	//|ИЗ
	//|	Справочник.ITC_Проекты КАК ITC_Проекты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Задача КАК ОбЗадача
	//|		ПО ITC_Проекты.Ссылка = ОбЗадача.Проект
	//|ГДЕ
	//|	ITC_Проекты.Ссылка = &Проект
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Задачи.Задача КАК Задача,
	//|	ВТ_Задачи.ЗапланированоЧасов КАК ЗапланированоЧасов,
	//|	ВТ_Задачи.ЖелаемаяДатаЗавершения КАК ЖелаемаяДатаЗавершения,
	//|	ВТ_Задачи.Тема КАК Тема,
	//|	ВТ_Задачи.Статус КАК Статус,
	//|	ВТ_Задачи.Головная КАК Головная,
	//|	ВТ_Задачи.ПометкаУдаления КАК ПометкаУдаления,
	//|	СоответствиеЗадачИПроектов.СтатьяБюджета КАК СтатьяБюджета,
	//|	ЕСТЬNULL(ЧасыОбороты.ОтчетПриход, 0) КАК Факт,
	//|	ВТ_Задачи.Основание КАК Основание
	//|ИЗ
	//|	ВТ_Задачи КАК ВТ_Задачи
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Часы.Обороты(
	//|				,
	//|				,
	//|				Период,
	//|				Задача В
	//|					(ВЫБРАТЬ
	//|						вт.Задача КАК Задача
	//|					ИЗ
	//|						ВТ_Задачи КАК вт)) КАК ЧасыОбороты
	//|		ПО ВТ_Задачи.Задача = ЧасыОбороты.Задача
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗадачИПроектов КАК СоответствиеЗадачИПроектов
	//|		ПО ВТ_Задачи.Задача = СоответствиеЗадачИПроектов.Задача
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Головная УБЫВ" ;
	//яТЗ = Запрос.Выполнить().Выгрузить();
	//
	//яМассивНачало = Новый Массив();
	//Для Каждого яС ИЗ яТЗ Цикл
	//	яМассивНачало.Добавить(яС);
	//КонецЦикла;
	//
	//яМассивПорядок = Новый Массив();
	//яИтерация = 0;
	//Пока яИтерация < 10 Цикл
	//	й = 0;
	//	Пока й < яМассивНачало.Количество() Цикл
	//		яВ = яМассивНачало[й];
	//		Если ЗначениеЗаполнено(яВ.Основание) и ТипЗнч(яВ.Основание) = Тип("ДокументСсылка.Задача") Тогда
	//			Для Каждого яСтрока Из яМассивПорядок Цикл
	//				Если яСтрока.Задача = яВ.Основание Тогда
	//					яМассивПорядок.Добавить(яВ);
	//					яМассивНачало.Удалить(й);
	//					глДобавить(й, -1);
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//		Иначе
	//			яМассивПорядок.Добавить(яВ);
	//			яМассивНачало.Удалить(й);
	//		КонецЕсли;
	//		глИнк(й)
	//	КонецЦикла;
	//	
	//	глИнк(яИтерация);
	//КонецЦикла;
	//Для Каждого яВ ИЗ яМассивНачало Цикл
	//	яМассивПорядок.Добавить(яВ);
	//КонецЦикла;
	//
	//яЭлементыДерева = РаботыДерево.ПолучитьЭлементы();
	//яЭлементыДерева.Очистить();
	//Для Каждого яВ Из яМассивПорядок Цикл
	//	яРез = НайтиРодителя(яЭлементыДерева, яВ.Основание);
	//	Если яРез = Неопределено Тогда
	//		яРез = яЭлементыДерева;
	//	КонецЕсли;
	//	яС = яРез.Добавить();
	//	ЗаполнитьЗначенияСвойств(яС, яВ);
	//КонецЦикла;
	
	// #DIP-105# 07.12.2022 --
КонецПроцедуры

&НаСервере
Функция НайтиРодителя(ъЭлементы, ъОснование)
	Для Каждого яСтрока Из ъЭлементы Цикл
		Если яСтрока.Задача = ъОснование Тогда
			Возврат яСтрока.ПолучитьЭлементы();
		Иначе
			яРез = НайтиРодителя(яСтрока.ПолучитьЭлементы(), ъОснование);
			Если яРез <> Неопределено Тогда
				Возврат яРез;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатьи(Команда)
	ОбновитьТаблицуБюджета();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРаботы(Команда)
	ОбновитьТаблицуЗадач();
	
	Для Каждого яС Из РаботыДерево.ПолучитьЭлементы() Цикл
		Элементы.РаботыДерево.Развернуть(яС.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Функция ДобавитьЗадачуНаСервере(Статья, ГоловнаяЗадача = Неопределено)
	
	Задача = Документы.Задача.СоздатьДокумент();
	Задача.Проект = Объект.Ссылка;
	Задача.Дата = ТекущаяДата();
	Задача.Клиент = Объект.Клиент;
	Задача.Тема = "Работы по этапу " + Статья + " проекта " + Объект.Ссылка;
	Задача.Проект = Объект.Ссылка;
	Задача.КонтактноеЛицо = Объект.КонтактноеЛицо;
	Задача.Ответственный = Объект.Ответственный;
	
	яЭлементыДерева = РаботыДерево.ПолучитьЭлементы();
	Если ГоловнаяЗадача <> Неопределено Тогда
		Задача.Основание = ГоловнаяЗадача;
		Задача.тема = "Работы по этапу " + Статья + ", по задаче " + Головнаязадача + ", проекта " + Объект.Ссылка;
		
		Для Каждого яСтрока Из яЭлементыДерева Цикл
			Если яСтрока.Задача = ГоловнаяЗадача Тогда
				яЭлементыДерева = яСтрока.ПолучитьЭлементы();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Задача.Описание = Задача.Тема;
	Задача.Статус = Справочники.СтатусыДокументов.Новый;
	
	Задача.Записать(РежимЗаписиДокумента.Проведение);
	
	Стр = яЭлементыДерева.Добавить();
	Стр.Задача = Задача.Ссылка;
	Стр.СтатьяБюджета = Статья;
	Стр.Основание = ГоловнаяЗадача;
	Стр.Тема = Задача.Тема; 
	Стр.Статус = Задача.Статус;
	
	Возврат Задача.Ссылка;
КонецФункции

&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	Если Элементы.СтатьиБюджета.ТекущиеДанные.Статья <> Неопределено Тогда
		яЗадача = ДобавитьЗадачуНаСервере(Элементы.СтатьиБюджета.ТекущиеДанные.Статья);
		ОткрытьФорму("Документ.Задача.ФормаОбъекта", Новый Структура("Ключ", яЗадача), ЭтаФорма);
	Иначе
		ПоказатьПредупреждение(,"Не выбрана статья бюджета");
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура СохранитьРаботыНаСервере_Строки(ъЭлементы)
	
	Для Каждого Строка Из ъЭлементы цикл
		Запись = РегистрыСведений.СоответствиеЗадачИПроектов.СоздатьМенеджерЗаписи();
		Запись.Активность = Истина;
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Записать(Истина);
		СохранитьРаботыНаСервере_Строки(Строка.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРаботыНаСервере()
	
	СохранитьРаботыНаСервере_Строки(РаботыДерево.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРаботы(Команда)
	СохранитьРаботыНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	
	Если Элементы.РаботыДерево.ТекущиеДанные <> Неопределено Тогда
		
		яСтрока = Элементы.РаботыДерево.ТекущиеДанные;
		яЗадача = ДобавитьЗадачуНаСервере(яСтрока.СтатьяБюджета, яСтрока.Задача);
		ОткрытьФорму("Документ.Задача.ФормаОбъекта", Новый Структура("Ключ", яЗадача), ЭтаФорма);
		
	Иначе
		ПоказатьПредупреждение(,"Не выбрана головная задача");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗарегистрироватьМодицифированность() Экспорт
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатьиБюджетаПриИзменении(Элемент)
	//ЗарегистрироватьМодицифированность();
КонецПроцедуры


&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	//ЗарегистрироватьМодицифированность();
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтаФорма.Модифицированность Тогда
		СохранитьРаботыНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого яС Из РаботыДерево.ПолучитьЭлементы() Цикл
		Элементы.РаботыДерево.Развернуть(яС.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры
